import { Page } from "@/components/Page/Page";
import { navigaion } from "@/service/navigationMap";
import Image from "next/image";
import { StyledAdmin } from "@/components/styledPages/StyledAdmin";

export default function Admin() {
  return (
    <Page title={navigaion.about[1].title}>
      <StyledAdmin>
        <li>
          <div className="imageTitle">
            <Image
              src="/adminImage/goncharenko.jpg"
              alt="Honcharenko"
              width={320}
              height={450}
            />
            <div className="titleThumb">
              <h3 className="title">Гончаренко Юрій Анатолійович</h3>
              <p className="subtitle">
                директор Комунального закладу Білоцерківської міської ради
                дитячо-юнацької спортивної школи № 1
              </p>
              <p className="credo">«Слово тримаю - справу роблю!»</p>
            </div>
          </div>
          <div className="infoThumb">
            <div>
              <p className="text">Народився 9 грудня 1964 року</p>
              <p className="text">
                1982-1988 рр. навчання в Чернігівському Державному педагогічному
                університеті ім.Т.Г.Шевченка
              </p>
              <p className="text">
                1988-1994 рр. вчитель початкової військової підготовки
                Білоцерківської загальноосвітньої школи № 4
              </p>
              <p className="text">
                1994-1999 рр.тренер-викладач з плавання Комунального закладу
                Білоцерківської міської ради ДЮСШ № 2
              </p>
              <p className="text">
                1999-2003 рр. директор лікувально-оздоровчого комплексу «Лісова
                Казка» 2003-2006 рр. директор Комунального закладу
                Білоцерківської міської ради ДЮСШ № 2
              </p>
              <p className="text">
                2006-2012 рр. директор ЦДЮНСБ «Трудові резерви» з 2012 по
                теперішній час директор Комунального закладу Білоцерківської
                міської ради ДЮСШ № 1
              </p>
            </div>
            <div>
              <p className="text">
                2006- Почесна Грамота Міністерства освіти і науки України
              </p>
              <p className="text">
                2008- Почесна Відзнака Комітету з фізичного виховання
                Міністерства освіти і науки України «За особистий внесок в
                розвиток учнівського спорту України»
              </p>
              <p className="text">
                2014- Почесна Грамота Комітету з фізичного виховання
                Міністерства освіти і науки України
              </p>
              <p className="text">
                2014- Нагрудний знак «Відзнака міського голови»
              </p>
              <p className="text">
                2015- Грамота Департаменту освіти і науки Київської обласної
                Державної адміністрації
              </p>
              <p className="text">
                2017- Подяка Управління фізичної культури і спорту Київської
                обласної Державної адміністрації
              </p>
              <p className="text">
                2018-Почесна Грамота Київської Обласної ради
              </p>
              <p className="text">
                2019- Подяка Міністерства молоді та спорту України
              </p>
              <p className="text">2019- Грамота Київської Обласної ради</p>
            </div>
          </div>
        </li>
        <li>
          <div className="imageTitle reversed">
            <Image
              src="/adminImage/matviezh.jpg"
              alt="Honcharenko"
              width={320}
              height={450}
            />
            <div className="titleThumb">
              <h3 className="title">Матвієць Олена Григорівна</h3>
              <p className="subtitle">
                заступник директора з навчально-тренувальної роботи КЗ БМР ДЮСШ
                № 1 Відмінник освіти України Заслужений тренер України
              </p>
              <p className="credo">
                «Успіх приходить до того, хто робить те, що найбільше любить! »
              </p>
            </div>
          </div>
          <div className="infoThumb">
            <div>
              <p className="text">Народилась 23 березня 1957 року</p>
              <p className="text">
                1974-1978 рр. навчання у Львівському державному інституті
                фізичної культури та спорту
              </p>
              <p className="text">
                1978-1980 рр. тренер-викладач з плавання дитячо-юнацької
                спортивної школи спортивного клубу «ЮГОК» м.Кривий Ріг
              </p>
              <p className="text">
                1980-1982 рр. інструктор спортивного клубу «Рось»
              </p>
              <p className="text">
                1982-1984 рр. заступник директора дитячо- юнацької спортивної
                школи спортивного клубу «Рось» Білоцерківського виробничого
                об’єднання шин і ГАВ
              </p>
              <p className="text">
                1984-1997 рр. тренер-викладач Комунального закладу
                Білоцерківської міської ради ДЮСШ № 1
              </p>
              <p className="text">
                з 1997 р. по теперішній час заступник директора з
                навчально-тренувальної роботи Комунального закладу
                Білоцерківської міської ради ДЮСШ № 1
              </p>
            </div>
            <div>
              <p className="text">
                1996 - Почесне звання «Відмінник освіти України»
              </p>
              <p className="text">
                1998 – Присвоєно звання «Заслужений тренер України»
              </p>
              <p className="text">
                1998 – член «Золотого фонду » м.Біла Церква
              </p>
              <p className="text">
                2001 – звання «Суддя Національної категорії»
              </p>
              <p className="text">
                2006 – Відзнака управління освіти і науки Білоцерківської
                міської ради
              </p>
              <p className="text">
                2007 – Почесна грамота Міністерства освіти і науки України
              </p>
              <p className="text">
                2007 – Грамота Верховної ради України «За заслуги перед
                Українським народом»
              </p>
              <p className="text">
                2007 – Відзнака управління з фізичного виховання та спорту
                Київської обласної державної адміністрації
              </p>
              <p className="text">
                2011 – Відзнака управління з фізичного виховання та спорту
                Білоцерківської міської ради
              </p>
              <p className="text">
                2012 – Відзнака управління освіти і науки Білоцерківської
                міської ради
              </p>
            </div>
          </div>
        </li>
        <li>
          <div className="imageTitle">
            <Image
              src="/adminImage/zharenko.jpg"
              alt="Honcharenko"
              width={320}
              height={450}
            />
            <div className="titleThumb">
              <h3 className="title"> Царенко Володимир Вікторович</h3>
              <p className="subtitle">
                інструктор – методист комунального закладу Білоцерківської
                міської ради дитячо-юнацької спортивної школи № 1
              </p>
              <p className="credo">
                «Працювати відповідально і жити по совісті!»
              </p>
            </div>
          </div>
          <div className="infoThumb">
            <div>
              <p className="text">Народився 5 липня 1953 р.</p>
              <p className="text">
                1971 - 1975 рр. навчався в Київському державному інституті
                фізичної культури та спорту.
              </p>
              <p className="text">
                1976 - 1981 рр.працював асистентом на кафедрі фізичного
                виховання Білоцерківського сільськогосподарського інституту
              </p>
              <p className="text">
                1981 - 1988 рр. заступник директора з АГР Білоцерківського
                міського будинку вчителя
              </p>
              <p className="text">
                1988 - 1992 рр. директор Білоцерківського міського будинку
                вчителя
              </p>
              <p className="text">
                1992 - 2012 рр. керівник підрозділу з організації оздоровлення
                дітей управління освіти та науки Білоцерківської міської ради
              </p>
              <p className="text">
                2012 - 2013 рр. методист управління освіти та науки
                Білоцерківської міської ради
              </p>
              <p className="text">
                з 2013 р. по теперішній час інструктор-методист Комунального
                закладу Білоцерківської міської ради дитячо-юнацької спортивної
                школи № 1
              </p>
            </div>
          </div>
        </li>
      </StyledAdmin>
    </Page>
  );
}
