import { Page } from "@/components/Page/Page";
import { navigaion } from "@/service/navigationMap";
import { StyledCoaches } from "@/components/styledPages/StyledCoaches";
import { CoachItem } from "@/components/CoachItem/CoachItem";

const createCoach = (src, name, sport, description = " ", categary = " ") => {
  return { src, name, description, categary, sport };
};

export default function Coaches() {
  const coaches = [];
  coaches.push(
    createCoach(
      "vasheka.jpg",
      "Вашека Валентина Іванівна",
      "Тренер — викладач з плавання",
      "Почесний працівник фізичної культури та спорту України Заслужений працівник фізичної культури та спорту України Відмінник освіти України Заслужений тренер України ",
      "тренер ІІ категорія"
    ),
    createCoach(
      "matviezh.jpg",
      "Матвієць  Олена Григорівна ",
      "Тренер — викладач з плавання",
      "Відмінник освіти України Заслужений тренер України "
    ),
    createCoach(
      "litvin.jpg",
      "Литвин  Василь       Сергійович ",
      "Тренер — викладач з кульової стрільби",
      "Відмінник освіти України Заслужений тренер України "
    ),
    createCoach(
      "fedorenko.jpg",
      "Федоренко  Анатолій Миколайович",
      "Тренер — викладач з баскетболу",
      "Відмінник освіти України Заслужений тренер України ",
      "тренер вищої категорії"
    ),
    createCoach(
      "ivanenco.jpg",
      "Іваненко Володимир Миколайович",
      "Тренер — викладач з фехтування",
      "Заслужений тренер Казахстану та Киргизії"
    ),
    createCoach(
      "fandeeva.jpg",
      "Фандєєва Катерина Григорівна",
      "Тренер — викладач з плавання",
      " Майстер спорту  України"
    ),
    createCoach(
      "mikulovich.jpg",
      "Мікулович Євген Юрйович",
      "Тренер — викладач з фехтування",
      "Майстер спорту  України"
    ),
    createCoach(
      "agafonzheva.jpg",
      "Агафонцева Наталія Анатоліївна",
      "Тренер — викладач з спортивної гімнастики (дівчата)",
      " Майстер спорту СРСР  тренер  ІІ категорії "
    ),
    createCoach(
      "fill.jpg",
      "Філь  Яна  Сергіївна ",
      "Тренер — викладач з спортивної гімнастики (дівчата)",
      "Майстер спорту  України  тренер  ІІ категорії "
    ),
    createCoach(
      "valezhka.jpg",
      "Валецька Світлана Михайлівна ",
      "Тренер — викладач з спортивної гімнастики (дівчата)",
      " тренер  ІІ категорії  "
    ),
    createCoach(
      "simogaeva.jpg",
      "Сімогаєва Ольга Володимирівна",
      "Тренер — викладач з спортивної гімнастики (дівчата)",
      ""
    ),
    createCoach(
      "maksymenko.jpg",
      "Максименко Альберт Станіславович",
      "Тренер — викладач з спортивної гімнастики (хлопці)",
      ""
    ),
    createCoach(
      "dudnik.jpg",
      "Дуднік Людмила Василівна",
      "Тренер — викладач з спортивної гімнастики (хлопці)",
      "тренер ІІ категорії  "
    ),
    createCoach(
      "dyachuk.jpg",
      "Дячук Майя Іванівна ",
      "Тренер — викладач з спортивної гімнастики (хлопці)",
      "тренер ІІ категорії  "
    ),
    createCoach(
      "karpova.jpg",
      "Карпова Тетяна Григорівна",
      "Тренер — викладач з плавання",
      "  тренер  І категорії "
    ),
    createCoach(
      "vinichenko.jpg",
      "Вініченко Максим Миколайович",
      "Тренер — викладач з плавання",
      " тренер  ІІ категорії  "
    ),
    createCoach(
      "pustovit.jpg",
      "Пустовіт Катерина Ігорівна",
      "Тренер — викладач з плавання",
      " тренер  ІІ категорії  "
    ),
    createCoach(
      "overchenko.jpg",
      "Оверченко Юрій Володимирович",
      "Тренер — викладач з плавання",
      " тренер  ІІ категорії  "
    ),
    createCoach(
      "scherbakova.jpg",
      "Щербакова Інна Анатоліївна",
      "Тренер — викладач з плавання",
      ""
    ),
    createCoach(
      "tyschinska.jpg",
      "Тищинська Олена Олександрівна",
      "Тренер — викладач з плавання",
      "тренер  І категорії "
    ),
    createCoach(
      "lavreniuk.jpg",
      "Лавренюк Олена  Іванівна",
      "Тренер — викладач з плавання",
      "тренер ІІ категорії  "
    ),
    createCoach(
      "lavreniukMen.jpg",
      "Лавренюк Олександр Олександрович",
      "Тренер — викладач з плавання",
      ""
    ),
    createCoach(
      "karpov.jpg",
      "Карпов Генадій Петрович",
      "Тренер — викладач з плавання",
      ""
    ),
    createCoach(
      "omelchuk.jpg",
      "Гаюк-Омельчук Олександра Олександрівна ",
      "Тренер — викладач з волейболу",
      " тренер  ІІ категорії  "
    ),
    createCoach(
      "dariy.jpg",
      "Датій Ольга Германівна  ",
      "Тренер — викладач з волейболу",
      "тренер вищої категорії "
    ),

    createCoach(
      "gnatiuk_denis.jpg",
      "Гнатюк Денис Вікторович",
      "Тренер — викладач з баскетболу"
    ),
    createCoach(
      "plehatiy_dmetro.jpg",
      "Пелехатий Дмитро Олександрович",
      "Тренер — викладач з баскетболу"
    ),

    createCoach(
      "yakymenko.jpg",
      "Якименко Володимир Олександрович",
      "Тренер — викладач з фрі-файту",
      "тренер ІІ категорії"
    ),

    createCoach(
      "ziglin.jpg",
      "Зіглін Олег Євгенович ",
      "Тренер — викладач з спортивного орієнтування, тренер — викладач з скелелазіння",
      "тренер  ІІ категорії "
    ),
    createCoach(
      "demianzev.jpg",
      "Дем'янцев      Василь Іванович",
      "Тренер — викладач з панкратіону",
      "тренер вищої категорії "
    )
  );
  return (
    <Page title={navigaion.about[2].title}>
      <StyledCoaches>
        {coaches.map((item) => (
          <CoachItem
            key={item.src}
            src={`/coaches/${item.src}`}
            title={item.name}
            subtitle={item.description}
            category={item.categary}
            sport={item.sport}
          />
        ))}
      </StyledCoaches>
    </Page>
  );
}
