import { Page } from "@/components/Page/Page";
import { navigaion } from "@/service/navigationMap";
import { StyledMedcalOffice } from "@/components/styledPages/StyledMedicalOffice";
import { CoachItem } from "@/components/CoachItem/CoachItem";

export default function MedicalOfice() {
  return (
    <Page title={navigaion.about[5].title}>
      <StyledMedcalOffice>
        <p className="photoSubtitle">
          Медичний супровід навчально-тренувального процесу забезпечують:
        </p>
        <ul className="imageList">
          <CoachItem
            title="Погребняк Тамара Михайлівна"
            src="/medical/pohrebniak.jpg"
          />
          <CoachItem
            title="Лук'янець Тамара Олександрівна"
            src="/medical/lukyanezh.jpg"
          />
          <CoachItem
            title="Мілянець Діана Анатоліїївна"
            src="/medical/milianezh.jpg"
          />
        </ul>
        <div className="textDiv">
          <h3>Травматизм та його попередження у дітей</h3>
          <p className="text">
            Термін “травма” означає тілесне пошкодження при пораненні.
            Пошкодження, які повторювались у певній групі населення, називаються
            <span> травматизмом.</span>
          </p>
          <p>
            Під дитячим травматизмом слід розуміти сукупність раптово виниклих
            ушкоджень серед дітей різного віку. Травми серед дітей, на жаль,
            зустрічаються досить часто і мають багато особливостей.
          </p>
          <p>
            За місцем виникнення травматизм поділяють на: побутовий,
            <span className="bold">транспортний, шкільний і спортивний.</span>
          </p>
          <p>
            Також є
            <span className="bold">
              вуличний, вогнепальний, сільськогосподарський, виробничий,
              нещасний випадок на воді, задушення та отруєння.
            </span>
          </p>
          <p>Найчастіше зустрічається побутовий травматизм.</p>
          <p>
            <span className="bold noLeft">Побутовий травматизм</span>- це
            ушкодження, які діти отримали вдома: у квартирі, у дворі чи в саду.
            Ушкодження при цьому найрізноманітні, але найнебезпечніші з них це
            опіки полум’ям, хімічними речовинами і падіння з висоти.
          </p>
          <p>
            Принципи запобігання побутового травматизму різноманітні, але
            головною і надійною з них є постійна турбота дорослих про безпеку
            дітей вдома. Дорослі систематично повинні виховувати в дітях
            обачливість і обережність, особливо при поводженні з вогнем і
            небезпечними приладами. Потрібно застерігати дітей від пустощів на
            балконах, драбинах, деревах. Разом з тим батьки ні в якому разі не
            повинні забороняти дітям гратися в рухливі ігри, сковувати їх
            безперервними заборонами та обмеженнями: все потрібно робити
            помірковано, щоб не образити і не принизити дитину.
          </p>
          <p>
            Найвищий відсоток смертності після причинених травм від автомашин,
            автобусів, тролейбусів, потягів та інших видів транспорту. І знову ж
            таки, головними причинами є недоглянутість дітей на вулиці, по
            дорозі до школи, а також у години дозвілля. Призводить до цього
            незнання дітьми правил дорожнього руху, порушення правил
            користування транспортом.
          </p>
          <p>
            Надзвичайно небезпечно кататись дітям на велосипедах, мопедах,
            моторолерах, скутерах, якщо вони не склали відповідних іспитів на
            право водіння. Дорослим ні на мить не можна забувати, що діти
            схильні наслідувати їх. Якщо дитина бачить що старші порушують
            правила вуличного руху, або легковажно ставлять до рекомендації
            стосовно особистої безпеки, той від дитини марно вимагати чогось
            іншого, бо дитина перш за все бере приклад з дорослих. Лише спільні
            зусилля батьків, учителів, вихователів працівників громадських
            організацій зможуть забезпечити позитивний ефект у боротьбі з
            дитячим травматизмом.
          </p>
          <p>
            <span className="bold noLeft" style={{ color: "#1f158c" }}>
              Шкільний травматизм{" "}
            </span>{" "}
            діти отримують під час перерв, у класах, коридорах. Основна причина
            шкільного травматизму - це недостатня виховна робота: діти проводять
            перерви, як їм заманеться. Окремі викладачі не знають основи
            запобігання травм або нехтують ними: допускають перевантаження
            навчальних майстерень під час проведення занять, дозволяють учням
            приходити на уроки у повсякденному одязі. Як і при будь-яких видах
            дитячого травматизму, у даному разі при плануванні профілактичних
            заходів треба керуватись двома основними принципами: чітко
            налагоджена організація трудового процесу і висока освітньо-виховна
            робота. В кожному кабінеті є правила техніки безпеки при різних
            видах робіт.
            <span className="bold" style={{ fontStyle: "italic" }}>
              На початку кожного уроку потрібно їх повторювати. Діти повинні
              усвідомлювати, що під час виробничого навчання треба бути
              надзвичайно уважними, зібраними, ретельно виконувати всі настанови
              учителя, строго дотримуватись техніки безпеки.
            </span>
          </p>
          <p>
            <span className="bold noLeft" style={{ color: "#1f158c" }}>
              Спортивний травматизм.
            </span>
            Фізкультура і спорт є могутнім засобом зміцнення організму і
            фізичного розвитку дітей, але це тільки при вмілому і правильно
            організованому занятті спортом. Але, на превеликий жаль, дитячих
            спортивних закладів поки що недостатня кількість і до того ж не всі
            батьки розуміють їх користь, вважаючи що дитина може займатися
            спортом і без тренера. Тому багато підлітків грають у футбол, хокей,
            їздять на велосипедах без старших досвідчених товаришів. Або
            обирають місця, не зовсім придатні для ігор, а часто і небезпечні:
            річки, захаращені двори, глибокі водойми, пустища. При
            неорганізованому занятті спортом трапляється найбільше спортивних
            ушкоджень.{" "}
            <span className="bold" style={{ fontStyle: "italic" }}>
              {" "}
              Тому батьки повинні якомога раніше залучати дитину до занять у
              спортивних добровільних товариствах, на стадіонах. Цим вони не
              тільки загартують дитину, а й вбережуть від страшної небезпеки.
            </span>
          </p>
        </div>
      </StyledMedcalOffice>
    </Page>
  );
}
