import { StyledHystory } from "@/components/styledPages/styledHystory";
import { navigaion } from "@/service/navigationMap";
import Image from "next/image";
import { Page } from "@/components/Page/Page";

export default function History() {
  return (
    <Page title={navigaion.about[0].title}>
      <StyledHystory>
        <div className="textContainer">
          <p className="text">
            Білоцерківська дитячо-юнацька спортивна школа №1 розпочала свою
            роботу в 1946 році. Спортивна школа поступово пропонувала заняття у
            секціях велоспорту, фехтування, вільної боротьби, спортивної
            гімнастики та баскетболу.
          </p>
          <p className="text">
            30 грудня 1982 року була введена в експлуатацію перша частина
            комплексу, а з 1984 року приміщення ДЮСШ № 1 функціонують у повному
            обсязі за адресою: вул. Героїв Небесної Сотні, 46\а.
          </p>
          <p className="text">
            Школа має п’ять спортивних класів, які навчаються на базі
            загальноосвітньої школи № 18. Тренери тісно співпрацюють з міською
            гімназією № 2. Кадети цієї гімназії засвоюють ази плавання, стрільби
            кульової, фехтування.
          </p>
        </div>
        <div className="imageThumb">
          <Image
            src="/placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="imageThumb">
          <Image
            src="/placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="textContainer">
          <p className="text">
            За період роботи тренерами школи підготовлено більше 150 майстрів
            спорту Радянського Союзу та України.
          </p>
          <p className="text">
            11 випускників школи виконали норматив МСМК: Кащенко Світлана
            (стрільба кульова); Аржанков Дмитро (стрільба кульова); Шовкопляс
            Тетяна (стрільба кульова); Антонков Олег (стрільба кульова);
            Корнієнко Сергій (стрільба кульова); Чумаченко Денис (стрільба
            кульова); Бреус Сергій (плавання); Мукомол Ольга (плавання);
            Сизоненко Денис (плавання); Коваленко Андрій (плавання); Любаневич
            Артем (гімнастика спортивна); Ошаров Віталій фехтування) - став
            заслуженим майстром спорту.
          </p>
          <p className="text">
            В 2000 році випускниця школи Мукомол Ольга (плавання) захищала честь
            України на Олімпіаді в Сіднеї.
          </p>
          <p className="text">
            ВВ 2004 році вже три випускники школи були учасниками Олімпійських
            ігор в Афінах: Мукомол Ольга (плавання); Сизоненко Денис (плавання);
            Ошаров Віталій (фехтування).
          </p>
          <p className="text">
            У 2008 році – Бреус Сергій (плавання) - учасник Олімпійських ігор в
            Пекіні.
          </p>
        </div>
        <div className="textContainer">
          <p className="text">
            За період роботи тренерами школи підготовлено більше 150 майстрів
            спорту Радянського Союзу та України.
          </p>
          <p className="text">
            11 випускників школи виконали норматив МСМК: Кащенко Світлана
            (стрільба кульова); Аржанков Дмитро (стрільба кульова); Шовкопляс
            Тетяна (стрільба кульова); Антонков Олег (стрільба кульова);
            Корнієнко Сергій (стрільба кульова); Чумаченко Денис (стрільба
            кульова); Бреус Сергій (плавання); Мукомол Ольга (плавання);
            Сизоненко Денис (плавання); Коваленко Андрій (плавання); Любаневич
            Артем (гімнастика спортивна); Ошаров Віталій фехтування) - став
            заслуженим майстром спорту.
          </p>
          <p className="text">
            В 2000 році випускниця школи Мукомол Ольга (плавання) захищала честь
            України на Олімпіаді в Сіднеї.
          </p>
          <p className="text">
            ВВ 2004 році вже три випускники школи були учасниками Олімпійських
            ігор в Афінах: Мукомол Ольга (плавання); Сизоненко Денис (плавання);
            Ошаров Віталій (фехтування).
          </p>
          <p className="text">
            У 2008 році – Бреус Сергій (плавання) - учасник Олімпійських ігор в
            Пекіні.
          </p>
        </div>
        <div className="imageThumb">
          <Image
            src="/placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="imageThumb">
          <Image
            src="/placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="textContainer">
          <p className="text">
            Відділення баскетболу було відкрито у 1954 році. Успіхом можна
            назвати виступ збірної ДЮСШ № 1, складеної з тоді ще юнаків 1969-70
            років народження, які на Чемпіонаті України серед ДЮСШ в 1986 році в
            м. Луцьк посіли І місце.
          </p>
          <p className="text">
            З 1992 року в місті Біла Церква була заснована команда майстрів
            «Олександрія-Рось», яка приймала участь в суперлізі Чемпіонату
            України з баскетболу та була укомплектована випускниками нашої
            школи.
          </p>
          <p className="text">
            Вихованець школи Захаренко Олексій у складі збірної команди України
            посів четверте місце в першості Європи з баскетболу серед хлопців
            1978 року народження в Португалії в 1995 році.
          </p>
          <p className="text">
            Команда юнаків 1995 р.н. з баскетболу в 2010 році приймала участь у
            Всеукраїнській юнацькій баскетбольній лізі і посіла 6 місце «група
            Б». Кращі гравці: Крилов Олег, Габріадзе Геннадій, Ткач Степан,
            Прохоренко Ігор.
          </p>
        </div>
        <div className="textContainer">
          <p className="text">
            Відділення гімнастики спортивної було засновано в 1948 році. Тоді
            гімнастам доводилось тренуватися у старому приміщенні. Багато
            вихованців успішно виступали на Всесоюзних змаганнях, спартакіадах.
            Переможцями ставали Кузьменко Тетяна, Баранчик Ірина, Касьян Людмила
            та інші.
          </p>
          <p className="text">
            У 1982 році жіноче відділення спортивної гімнастики очолював великий
            ентузіаст своєї справи Анатолій Васильович Кольцов. Під його
            керівництвом було підготовлено 10 майстрів спорту. Серед них були і
            срібна призерка чемпіонату світу зі стрибків із жердиною Анжела
            Балахонова, Тетяна Ходаченко, Юлія Нікітченко, Наталія Пилипчик і
            т.д.
          </p>
          <p className="text">
            З 1984 року відділення почало працювати на особистій спортивній базі
            у спеціалізованому залі гімнастики. Вихованки відділення в різні
            роки ставали призерами чемпіонатів та першостей України.
          </p>
          <p className="text">
            У 1992 році збірна команда Київської області (юнаки) складена з
            учнів ДЮСШ № 1 стала переможцем першості України, а в особистій
            першості за програмою І розряду золото здобув Олександр Висіцький.
          </p>
          <p className="text">
            З цього часу гімнасти відділення входять до еліти дитячої спортивної
            гімнастики України. Значних успіхів досяг вихованець відділення
            Молєв Євген-МСУ. У 2001 році на Кубку світу серед школярів 1984 р.н.
            та мол. здобув срібну нагороду в багатоборстві, та золото у вправах
            на коні. Неодноразовий чемпіон першостей України, переможець
            міжнародних турнірів: в Чехії-2000 р.; США-грудень 2001, Ірані-лютий
            2002; Любаневич Артем-МСУ-переможець міжнародних змагань у
            Бельгії-2001 р., Хорватії-2002 р.; Колтаков Олексій-МСУ, 3-и разовий
            володар Кубку України 2009 р., 2011 р., учасник чемпіонату
            Європи-2009 р., фіналіст етапів Кубку Єсвіту-2009 р., 2011 р.,
            11-кратний переможець чемпіонатів першостей України-2006-2011 рр.
          </p>
        </div>

        <div className="imageThumb">
          <Image
            src="/vertical_placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="imageThumb">
          <Image
            src="/placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="textContainer">
          <p className="text">
            Відділення стрільби кульової було засновано в 1961 році на базі
            Білоцерківського стрілецько-спортивного клуба ДОСААФ. Розвиток цього
            виду гальмувався відсутністю власної спортивної бази. Лише після
            завершення будівництва нового спорткомплексу ДЮСШ № 1 з 1984 року
            спортсменам була надана можливість реалізувати свій потенціал. А
            біля витоків успіхів білоцерківських снайперів стояв Заслужений
            тренер України-Петро Кузьмович Гавриленко. Згодом прийшли успіхи і
            на Всеукраїнському рівні.
          </p>
          <p className="text">
            Останні роки відділення очолює заслужений тренер України, майстер
            спорту Литвин Василь Сергійович. Гордістю відділення є його
            вихованці, майстри спорту міжнародного класу: Олег Антонков, Тетяна
            Шовкопляс, Денис Чумаченко, останній-бронзовий призер першості
            Європи-2000 рік, неодноразовий переможець та призер Чемпіонатів
            України.
          </p>
        </div>
        <div className="textContainer">
          <p className="text">
            Фехтування в Білій Церкві має глибоке коріння, біля витоків якого
            стоїть Григорій Ісакович Ніренштейн. Завдяки йому в 50-ті роки й
            було започатковано відділення фехтування в ДЮСШ № 1. Вихованка
            Григорія Ісаковича Нурія Єнілеева (Коваленко ) стає чемпіонкою
            України-1960 року, входить до збірної команди України, переможниця
            ЦС «Спартак». Також успішно виступали: Вадим Березовський, Яков
            Табак, Людмила Єгорова.
          </p>
          <p className="text">
            На початку 80-х років з”являються нові тренерські кадри, що відразу
            беруться за справу. Учні В.Г.Дубенка, С.В.Апалькова, В.М.Іваненка,
            О.М.Лисинчука завойовують все нові спортивні вершини.
          </p>
          <p className="text">
            Дев’яності роки характеризуються зміною тренерських поколінь, на
            зміну ветеранам приходить молодь, приносячи з собою нове бачення,
            нові ідеї з”являються нові зірочки-Ольга Ошарова -чемпіонка І
            Чемпіонату ЦСК «Гарт», Віталій Ошаров – заслужений майстер спорту,
            учасник Олімпійських ігор; Олег Некрасов та Юрій Христенко беруть
            участь спочатку в юніорській першості світу, а згодом в юніорській
            першості Європи.
          </p>
        </div>
        <div className="imageThumb">
          <Image
            src="/placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="imageThumb">
          <Image
            src="/placeholder.jpg"
            alt="placeholder"
            width={625}
            height={430}
          />
        </div>
        <div className="textContainer">
          <p className="text">
            Відділення плавання в ДЮСШ № 1 було відкрите у 1981 р., але за
            відсутністю власної спортивної бази тренування проводили на базі
            басейну спортивного клубу Армії, і тільки з 1985 року у відділенні
            з”явився власний двадцятип”ятиметровий басейн (6 доріжок). За роки
            незалежності плавці ДЮСШ № 1 неодмінно входять до фаворитів усіх
            змагань Київщини. Рахуються зі спортсменами школи й на
            Всеукраїнському рівні. Неодноразовими призерами чемпіонатів України
            стають: О.Білошицька, Т.Гречко, Ю.Горобченко, Р.Давлетов, О.Говоров,
            О.Слободянюк.
          </p>
          <p className="text">
            У 1994 році розпочалась спортивна кар’єра одної з відомих
            спортсменок Білої Церкви Ольги Мукомол. На протязі десяти років вона
            захищала честь нашої держави у складі національної збірної.
          </p>
          <p className="text">
            Намагались наслідувати приклад землячки і інші вихованці ДЮСШ.
            Призерами та переможцями різноманітних Всеукраїнських змагань стають
            Катерина Кунгурцева, Олена Німак, Олександра Пантелєєва, Сергій
            Бреус, Денис Сизоненко, Тетяна Дишлюк, Олександра Груневич, Андрій
            Коваленко, Єгор Філь, Андрій Ковбаса, Ганна Кожура та багато інших.
            Сьогодні відділення очолює заслужений працівник фізичної культури та
            спорту, заслужений тренер України - Вашека Валентина Іванівна.
          </p>
        </div>

        <div className="textContainer">
          <p className="text">
            З 1998 року в м. Біла Церква було відкрито Київський обласний
            ліцей-інтернат фізичної культури та спорту. Найкращі учні нашої
            школи продовжують навчання в ньому.
          </p>
          <p className="text">
            У такому короткому описі неможливо розповісти про всі здобутки ДЮСШ
            № 1, згадати всіх його вихованців та тренерів.
          </p>
          <p className="text">
            Більше 30 учнів школи навчаються в спеціалізованих спортивних
            закладах області.
          </p>
          <p className="text">
            На сьогоднішній день школу очолює- директор ГОНЧАРЕНКО Юрій
            Анатолійович, заступник директора з навчально-тренувальної роботи:
            МАТВІЄЦЬ Олена Григорівна, інструктор-методист ЦАРЕНКО Володимир
            Вікторович.
          </p>
        </div>
      </StyledHystory>
    </Page>
  );
}
